Books_And_Tutorials/DotNet/TPL/Task.html
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml"
lang="en" xml:lang="en">
<head>
<title>Task </title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2013-12-28 20:51:23 "/>
<meta name="author" content=""/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
</head>
<body>
<div id="content">

<h1 class="title">Task </h1>


<meta http-equiv="Content-Style-Type" content="text/css">
<link rel="stylesheet" href="../../../CSS/org-style.css" type="text/css" />
<style type="text/css"/><!--
  pre.display { font-family:inherit }
  pre.format  { font-family:inherit }
  pre.smalldisplay { font-family:inherit; font-size:smaller }
  pre.smallformat  { font-family:inherit; font-size:smaller }
  pre.smallexample { font-size:smaller }
  pre.smalllisp    { font-size:smaller }
  span.sc    { font-variant:small-caps }
  span.roman { font-family:serif; font-weight:normal; } 
  span.sansserif { font-family:sans-serif; font-weight:normal; } 
--></style>
<div id="postamble">
<p class="author"> Author: Pralay Patoria
<a href="mailto:ppatoria@gmail.com">&lt;ppatoria@gmail.com&gt;</a>
</p>
<p class="date"> Date: 24-12-2013</p>
</div>

<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 Cancellation </a></li>
<li><a href="#sec-2">2 Task </a></li>
<li><a href="#sec-3">3 TaskFactory </a></li>
<li><a href="#sec-4">4 TaskSchedula </a></li>
<li><a href="#sec-5">5 Timer </a></li>
</ul>
</div>
</div>


<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Cancellation </h2>
<div class="outline-text-2" id="text-1">

<ol>
<li>
<b>CancellationToken</b> contains flag to set operation task as cancel.
<ul>
<li>
The async operation can check that flag and take appropriate action 
</li>
<li>
Even can throw exception. 
This is helpful in case of task where it is absorbed and later propagated to main thread. 
It provides main thread the information that the task was canceled and was not completed.
<ul>
<li>
Exceptions are absorbed and can be retrieved when calling function calls Result or Wait in case of Task.
</li>
</ul>
</li>
<li>
Main thread can register cancellation callback which will be invoked when the task is canceled.
<ul>
<li>
Chain of callbacks can be registered. 
Which are invoked when any of the operation registered is canceled.

</li>
</ul>
</li>
</ul>
</li>
</ol>
</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Task </h2>
<div class="outline-text-2" id="text-2">

<ol>
<li>
<b>Return result</b> 
</li>
<li>
<b>Exception propagation:</b> It absorbs exceptions, which can be retrieved later. 
<ol>
<li>
When Result is called in try catch block.
</li>
<li>
When Wait is called to wait till the task is finished.
</li>
</ol>
</li>
<li>
<b>Wait for the task to finish.</b>
</li>
<li>
<b>Cancellation of task:</b>
<ol>
<li>
Exception on cancel. Exception on cancel is absorbed and can be retrieved on when we call Result or Wait. 
</li>
<li>
Cancel flag can be set and task can check that.
</li>
</ol>
</li>
<li>
<b>Non Waiting:</b> ContinueWith functionality facilitates to run chain of tasks without waiting.

</li>
</ol>
</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> TaskFactory </h2>
<div class="outline-text-2" id="text-3">

<ol>
<li>
Schedule similar tasks using task scheduler.
</li>
<li>
Cancel can be applied on all the tasks of a task factory. 
No need to call cancel for all.

</li>
</ol>
</div>

</div>

<div id="outline-container-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> TaskSchedula </h2>
<div class="outline-text-2" id="text-4">

<p>Schedule the task in Thread Pool or GUI Thread Queue.
</p>
</div>

</div>

<div id="outline-container-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> Timer </h2>
<div class="outline-text-2" id="text-5">

<p>Task.Delay with await can be used for timer .
</p>


<pre class="src src-csharp">await Task.<span style="color: #b58900;">Delay</span> <span style="color: #268bd2;">ms</span> 
</pre>










</div>
</div>
<div id="postamble">
<p class="date"> Date: 2013-12-28 20:51:23 </p>
</div>
</div>
</body>
</html>
